### String

In [258]:
# f string and type
x = "Hello World"
y = "And Me"
print(f"Hello {x}".title())
print(f"Hello {x}".upper())
print(f"Hello {x}".lower())
print(f"Hello {x}".count("l"))
print(f"Hello {x}".replace("l","Q"))
print(f"Test {y} {x}")
print(type(x))

Hello Hello World
HELLO HELLO WORLD
hello hello world
5
HeQQo HeQQo WorQd
Test And Me Hello World
<class 'str'>

### List

In [259]:
countries = ['USA', 'India', 'UK']
print(countries[1])
print(countries[-2])
print(countries[0:3:1])
print(countries[:3])
print(countries[0:])
countries.append('XYZ')
countries.extend('X')
countries.insert(1, 'Z')
print(countries)

India
India
['USA', 'India', 'UK']
['USA', 'India', 'UK']
['USA', 'India', 'UK']
['USA', 'Z', 'India', 'UK', 'XYZ', 'X']

In [260]:
countries2 = ['A', 'B', 'C']

In [261]:
countries + countries2

['USA', 'Z', 'India', 'UK', 'XYZ', 'X', 'A', 'B', 'C']

In [262]:
nested_list = [countries, countries2]
nested_list

[['USA', 'Z', 'India', 'UK', 'XYZ', 'X'], ['A', 'B', 'C']]

In [263]:
# countries.remove('X')
# countries.pop() # if index not given starts removing from last
del countries2[0]

In [264]:
print(countries)
print(countries2)

['USA', 'Z', 'India', 'UK', 'XYZ', 'X']
['B', 'C']

In [265]:
num = [1,3,2,4]
num.sort()
num.sort(reverse = True)
num

[4, 3, 2, 1]

In [266]:
countries2[0] = 'F'
countries2

['F', 'C']

In [267]:
x = ['USA', 'Z', 'India', 'UK', 'XYZ', 'X', 'A', 'B', 'C']
y = x # or y = x[:]
y

['USA', 'Z', 'India', 'UK', 'XYZ', 'X', 'A', 'B', 'C']

### Modules

In [268]:
import os
os.getcwd()

'C:\\Users\\frien\\GitHub_Anaconda\\GitHub-JupyterLab'

In [269]:
os.listdir() # os.makesdirs() -> create new folder

['.git',
 '.ipynb_checkpoints',
 'bloxd_games.csv',
 'IMDB Dataset.csv',
 'Prince_Kumar.ipynb',
 'test1.ipynb',
 'Untitled.ipynb',
 'Work.ipynb']

## -> Pandas and Numpy

In [270]:
import pandas as pd
import numpy as np

In [271]:
data = np.array([[1,2], [3,4], [5,6]]) # 2 columns and 3 rows

### 1.creating a dataframe with array

In [272]:
# creating a dataframe with array with np
pd.DataFrame(data, index = ['row1', 'row2', 'row3'], columns = ['col1', 'col2'] )

      col1  col2
row1     1     2
row2     3     4
row3     5     6

In [273]:
data2 = [[1,2], [3,4], [5,6]]

In [274]:
# creating a dataframe with array without np same result
pd.DataFrame(data2, index = ['row1', 'row2', 'row3'], columns = ['col1', 'col2'] )

      col1  col2
row1     1     2
row2     3     4
row3     5     6

In [275]:
A = [1,2,3,4]
B = [11,22,33,44]

### 2.Creating dataframe with dictionary

In [276]:
# creating dataframe with dictionary
dic = {"A":A, 'B':B}
pd.DataFrame(dic, index = ['row1', 'row2', 'row3', 'row4'])

      A   B
row1  1  11
row2  2  22
row3  3  33
row4  4  44

In [277]:
dic2 = {'a': [1,2,3], 'b':[4,5,6], 'c':[7,8,9]}
pd.DataFrame(dic2, index = ['row1', 'row2', 'row3'])

      a  b  c
row1  1  4  7
row2  2  5  8
row3  3  6  9

### 3.Creating dataframe with csv file

In [278]:
df_mc = pd.read_csv('bloxd_games.csv')

In [279]:
df_mc.head(5)

          game_name  category  players release_status
0  Sandbox Survival  Survival     1700        POPULAR
1  Sandbox Peaceful   Sandbox      442            NaN
2  Sandbox Creative   Sandbox      506            NaN
3           Bedwars       PvP     1000        POPULAR
4         One Block  Building      874        UPDATED

In [280]:
# attributes of dataframe
print(df_mc.shape)
print(df_mc.index) 
print(df_mc.columns) # names of all columns
print(df_mc.dtypes) # types of all columns

(26, 4)
RangeIndex(start=0, stop=26, step=1)
Index(['game_name', 'category', 'players', 'release_status'], dtype='object')
game_name         object
category          object
players            int64
release_status    object
dtype: object

In [281]:
# methods of dataframe
df_mc.head()
df_mc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   game_name       26 non-null     object
 1   category        26 non-null     object
 2   players         26 non-null     int64
 3   release_status  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 964.0+ bytes

In [282]:
df_mc.describe() # numeric data only

           players
count    26.000000
mean    441.923077
std     633.911535
min      36.000000
25%     119.750000
50%     181.000000
75%     462.250000
max    2900.000000

In [283]:
# function
len(df_mc) # no. of rows

26

In [284]:
max(df_mc.players)

2900

In [285]:
min(df_mc.players)

36

In [286]:
type(df_mc)

pandas.core.frame.DataFrame

In [287]:
round(df_mc, 2) # round float values upto two places

           game_name    category  players release_status
0   Sandbox Survival    Survival     1700        POPULAR
1   Sandbox Peaceful     Sandbox      442            NaN
2   Sandbox Creative     Sandbox      506            NaN
3            Bedwars         PvP     1000        POPULAR
4          One Block    Building      874        UPDATED
5         Greenville    Roleplay      469            NaN
6       Lucky Towers   Mini-Game      107            NaN
7            Pirates   Adventure      262            NaN
8          Infection         PvP      177            NaN
9       Cube Warfare     Shooter      261            NaN
10         99 Nights    Survival      924        POPULAR
11        Last Stand    Survival      192            NaN
12           Skywars         PvP      185            NaN
13        Evil Tower        Obby      134            NaN
14         BloxD Hop        Obby       45            NaN
15       Doodle Cube    Building      149            NaN
16             Plots    Building      390            NaN
17    Murder Mystery     Mystery      138            NaN
18            Bridge         PvP       36            NaN
19         Paintball     Shooter       51            NaN
20     Hide and Seek  Party Game      152            NaN
21     Rocket Spleef   Mini-Game       69            NaN
22       Rocket Obby        Obby       65            NaN
23             Bingo  Party Game      115            NaN
24  Natural Disaster    Survival      147            NaN
25      Custom Games     Variety     2900            NaN

In [288]:
# extracting one column 1st method
df_mc['players']
df_mc['players'].head()

0    1700
1     442
2     506
3    1000
4     874
Name: players, dtype: int64

In [289]:
type(df_mc['players'])

pandas.core.series.Series

In [290]:
df_mc['players'].index

RangeIndex(start=0, stop=26, step=1)

In [291]:
# extracting one column 2nd method
df_mc.players.head()  
# note : if column name has space then this will not work (ex = df.naths score) then use 1st method

0    1700
1     442
2     506
3    1000
4     874
Name: players, dtype: int64

In [292]:
# extracting two or ore columns
df_mc[['players', 'category']].head()

   players  category
0     1700  Survival
1      442   Sandbox
2      506   Sandbox
3     1000       PvP
4      874  Building

In [293]:
type(df_mc[['players', 'category']])

pandas.core.frame.DataFrame

In [294]:
df_mc[['players', 'category', 'release_status']].head()
# canot access with . 2nd method

   players  category release_status
0     1700  Survival        POPULAR
1      442   Sandbox            NaN
2      506   Sandbox            NaN
3     1000       PvP        POPULAR
4      874  Building        UPDATED

In [295]:
# add new column with scalar value 
df_mc['new column'] = 10

In [296]:
df_mc.head()

          game_name  category  players release_status  new column
0  Sandbox Survival  Survival     1700        POPULAR          10
1  Sandbox Peaceful   Sandbox      442            NaN          10
2  Sandbox Creative   Sandbox      506            NaN          10
3           Bedwars       PvP     1000        POPULAR          10
4         One Block  Building      874        UPDATED          10

In [297]:
# add new column with different values 
# with array (no. of element is same as no. of row of df)
num = np.arange(0,26)
df_mc['num'] = num
df_mc.head()

          game_name  category  players release_status  new column  num
0  Sandbox Survival  Survival     1700        POPULAR          10    0
1  Sandbox Peaceful   Sandbox      442            NaN          10    1
2  Sandbox Creative   Sandbox      506            NaN          10    2
3           Bedwars       PvP     1000        POPULAR          10    3
4         One Block  Building      874        UPDATED          10    4

In [298]:
# array with random values int
random1 = np.random.randint(0, 100, size = 26) 
df_mc['randnum1'] = random1
df_mc.head()

,game_name,category,players,release_status,new column,num,randnum1
0,Sandbox Survival,Survival,1700,POPULAR,10,0,73
1,Sandbox Peaceful,Sandbox,442,NaN,10,1,16
2,Sandbox Creative,Sandbox,506,NaN,10,2,83
3,Bedwars,PvP,1000,POPULAR,10,3,87
4,One Block,Building,874,UPDATED,10,4,68

In [299]:
# array with random values float
random2 = np.random.uniform(0, 100, size = 26)
df_mc['randnum2'] = random2
df_mc.head()

,game_name,category,players,release_status,new column,num,randnum1,randnum2
0,Sandbox Survival,Survival,1700,POPULAR,10,0,73,51.523605
1,Sandbox Peaceful,Sandbox,442,NaN,10,1,16,97.311035
2,Sandbox Creative,Sandbox,506,NaN,10,2,83,60.193540
3,Bedwars,PvP,1000,POPULAR,10,3,87,22.384907
4,One Block,Building,874,UPDATED,10,4,68,82.179064

In [300]:
# add multiple columns using assign()
score1 = np.random.uniform(100, 1000, size = 26)
score2 = np.random.uniform(100, 1000, size = 26)

In [301]:
series1 = pd.Series(score1, index = np.arange(0,26))
series2 = pd.Series(score2, index = np.arange(0,26))
df_mc = df_mc.assign(Score1 = series1, Score2 = series2)
df_mc.head()

,game_name,category,players,release_status,new column,num,randnum1,randnum2,Score1,Score2
0,Sandbox Survival,Survival,1700,POPULAR,10,0,73,51.523605,582.931581,419.593873
1,Sandbox Peaceful,Sandbox,442,NaN,10,1,16,97.311035,931.637583,683.940556
2,Sandbox Creative,Sandbox,506,NaN,10,2,83,60.193540,312.504880,531.623892
3,Bedwars,PvP,1000,POPULAR,10,3,87,22.384907,783.959868,625.779536
4,One Block,Building,874,UPDATED,10,4,68,82.179064,578.139179,763.140228

In [302]:
# adding column to specific index or position using insert() 
#df_mc.insert(5, 'test2', series1)
df_mc.head()

,game_name,category,players,release_status,new column,num,randnum1,randnum2,Score1,Score2
0,Sandbox Survival,Survival,1700,POPULAR,10,0,73,51.523605,582.931581,419.593873
1,Sandbox Peaceful,Sandbox,442,NaN,10,1,16,97.311035,931.637583,683.940556
2,Sandbox Creative,Sandbox,506,NaN,10,2,83,60.193540,312.504880,531.623892
3,Bedwars,PvP,1000,POPULAR,10,3,87,22.384907,783.959868,625.779536
4,One Block,Building,874,UPDATED,10,4,68,82.179064,578.139179,763.140228

### maths operations
#### in columns

In [303]:
# select column and calculate total sum, count, mean, std, max, min
df_mc['players'].sum()
df_mc['players'].describe()

count      26.000000
mean      441.923077
std       633.911535
min        36.000000
25%       119.750000
50%       181.000000
75%       462.250000
max      2900.000000
Name: players, dtype: float64

In [310]:
df_mc.set_index('index')

KeyError: "None of ['index'] are in the columns"

In [312]:
df_mc.sort_index().head()

,game_name,category,players,release_status,new column,num,randnum1,randnum2,Score1,Score2
0,Sandbox Survival,Survival,1700,POPULAR,10,0,73,51.523605,582.931581,419.593873
1,Sandbox Peaceful,Sandbox,442,NaN,10,1,16,97.311035,931.637583,683.940556
2,Sandbox Creative,Sandbox,506,NaN,10,2,83,60.193540,312.504880,531.623892
3,Bedwars,PvP,1000,POPULAR,10,3,87,22.384907,783.959868,625.779536
4,One Block,Building,874,UPDATED,10,4,68,82.179064,578.139179,763.140228